# coding=utf8
import jieba

data_path = 'sources/weibo_senti_100k.csv'
data_list = open(data_path, encoding='utf8').readlines()[1:]

data_stop_path = 'sources/hit_stopword'
stop_word = open(data_stop_path, encoding='utf8').readlines()
stop_word = [line.strip() for line in stop_word]
stop_word.append(' ')
stop_word.append('\n')

voc_item = {}
min_seq = 1
top_n = 1000

UNK = '<UNK>'
PAD = '<PAD>'

for item in data_list[:100]:
    label = item[0]
    content = item[2:].strip()
    seg_list = jieba.cut(content)

    seg_res = []

    for seg_item in seg_list:
        # print(seg_item)

        if seg_item in stop_word:
            continue

        seg_res.append(seg_item)

        if seg_item in voc_item.keys():
            voc_item[seg_item] = voc_item[seg_item] + 1
        else:
            voc_item[seg_item] = 1

    # print(content)
    # print(seg_res)

voc_list = sorted([_ for _ in voc_item.items() if _[1] > min_seq],
                  key=lambda x: x[1], reverse=True)[:top_n]
print(voc_list)
print(len(voc_list))

voc_list = {word_count[0]: idx for idx, word_count in enumerate(voc_list)}
voc_list.update({UNK: len(voc_list), PAD: len(voc_list) + 1})

print(voc_list)
print(len(voc_list))

# {'嘻嘻': 0, '鼓掌': 1, '爱': 2, '都': 3, '旅游': 4, '!': 5, '上': 6, '很': 7, '小': 8, '好': 9, '中': 10, '回复': 11, '太': 12, '宝宝': 13, 'http': 14, 'cn': 15, '微博': 16, '赣州': 17, '美食': 18, 't': 19, '会': 20, '去': 21, '偷笑': 22, '不': 23, '转发': 24, '日照': 25, '看': 26, '开心': 27, '恭喜': 28, '可爱': 29, '老师': 30, '新浪': 31, '更': 32, '赞': 33, '今天': 34, '拍': 35, '吃': 36, '说': 37, '放假': 38, '梦想': 39, '花心': 40, '喜欢': 41, '猫': 42, '霍思燕': 43, '做': 44, '真': 45, '找': 46, '雪': 47, '大象': 48, '中国': 49, '购票': 50, '别人': 51, '人': 52, '姐姐': 53, '湖北': 54, '朋友': 55, '加班': 56, '谢谢': 57, '酒店': 58, '明天': 59, '见': 60, '阿姨': 61, '厦门': 62, '生活': 63, '小江江': 64, '时': 65, '神奇': 66, '亲亲': 67, '还': 68, '带': 69, '快乐': 70, '冷': 71, '喔': 72, '朱': 73, '赖': 74, '华丽': 75, '期待': 76, 'V': 77, '走': 78, '心': 79, '第一': 80, '搜': 81, '投资': 82, '地方': 83, '得到': 84, '店': 85, '礼物': 86, '一起': 87, '样子': 88, '雪人': 89, '南非': 90, '壶': 91, '天': 92, '权': 93, '金城': 94, '年': 95, '昆明': 96, '航空': 97, '企业': 98, '鱼': 99, '围观': 100, '家': 101, '高': 102, '君亭': 103, '―': 104, '客家': 105, '哭': 106, '周墙': 107, '世界': 108, '姑娘': 109, '羡慕': 110, '高兴': 111, '美': 112, '大': 113, '收到': 114, '偶是': 115, '稀饭': 116, '字': 117, '生': 118, '天下': 119, '行': 120, '哥': 121, '游子': 122, '现在': 123, '呵呵': 124, '早安': 125, '下': 126, '落泪': 127, '8': 128, '3': 129, '杜江': 130, '看到': 131, '宝贝': 132, '祝福': 133, '公司': 134, '摇篮': 135, '东方': 136, '第一次': 137, '见到': 138, '面膜': 139, '一片': 140, '15': 141, '超': 142, '起来': 143, '持续': 144, '片': 145, '链接': 146, '感动': 147, '大家': 148, '感觉': 149, '放': 150, '冰箱': 151, '分三步': 152, '手机': 153, '维他命': 154, '探子': 155, '不赖': 156, '丽': 157, '同事': 158, '陪': 159, '星外星': 160, '声音': 161, '演唱会': 162, '陈文彪': 163, 'BC': 164, '俞文辉': 165, '爱心': 166, '双子': 167, '男': 168, '欢迎': 169, '失恋': 170, '才': 171, '海航': 172, '圆梦': 173, '直减': 174, '减直': 175, '500': 176, '一只': 177, '小予': 178, 'CAT': 179, 'caoz': 180, '很多': 181, '土豆': 182, '.....': 183, '目标': 184, '搜索': 185, '比例': 186, '北京': 187, '便宜': 188, '需要': 189, '童鞋': 190, 'LV': 191, '量化': 192, '丁鹏': 193, '富在': 194, '看不到': 195, '知道': 196, '支持': 197, '来自': 198, '系列': 199, '物': 200, '准备': 201, '餐厅': 202, '已经': 203, '以后': 204, '晚上': 205, '饿': 206, '东西': 207, '旅行': 208, '张赫': 209, 'z': 210, 'ryan': 211, '汽车': 212, '牛': 213, '时尚': 214, '适合': 215, '变': 216, '身': 217, '美丽': 218, '不要': 219, 'good': 220, '吃惊': 221, '海科': 222, '七星': 223, '智库': 224, '妹莉': 225, '十足': 226, '共乐': 227, '孙子': 228, '2010': 229, '月': 230, '右边': 231, '觉得': 232, '家庭': 233, '值得': 234, '灵魂': 235, '升起': 236, '分享': 237, '希望': 238, '最右': 239, '威武': 240, '传播': 241, '嘴': 242, '错号': 243, '求': 244, '出生': 245, '妈妈': 246, '事': 247, '买': 248, '幸福': 249, '前': 250, '票': 251, '大洋': 252, '亲': 253, '木头': 254, '夜里': 255, '梵高': 256, '回家': 257, '杭州': 258, '请': 259, '时间': 260, '好玩': 261, 'CEO': 262, '宁哥': 263, '帮主': 264, '出现': 265, '惊喜': 266, '觉悟': 267, '江西': 268, '盖': 269, '梆': 270, '朝鲜': 271, '一定': 272, '外景': 273, '契尔年': 274, '科': 275, '盛博': 276, '生日快乐': 277, '工作': 278, '成': 279, '时想': 280, '咔': 281, '无语': 282, '干掉': 283, 'Miami': 284, '美景': 285, '<UNK>': 286, '<PAD>': 287}

ff = open('sources/my_dict', 'w')
for item in voc_list.keys():
    # print()
    ff.writelines('{}, {}\n'.format(item, voc_list[item]))
ff.close()